In [2]:
import pandas as pd

In [4]:
forum_users = {
    "User ID":[1,2,3,4,5,6],
    "UserName":["mops1","mops2","mops3","mops4","mops5","mops6"],
    "Age": [187,185,16,198,17,11,],
    "Joined Date": pd.to_datetime(["2032-01-01","2031-07-07", "2013-07-06", "2111-08-08", "2001-09-09", "2031-09-10"]),
    "Total Posts":[123, 476, 2345, 234, 653645, None],
    "Reputation": [500, 212, 234, 12, 21, 3412]
}

df = pd.DataFrame(forum_users)
df

   User ID UserName  Age Joined Date  Total Posts  Reputation
0        1    mops1  187  2032-01-01        123.0         500
1        2    mops2  185  2031-07-07        476.0         212
2        3    mops3   16  2013-07-06       2345.0         234
3        4    mops4  198  2111-08-08        234.0          12
4        5    mops5   17  2001-09-09     653645.0          21
5        6    mops6   11  2031-09-10          NaN        3412

In [5]:
df[['UserName', 'Age']]

  UserName  Age
0    mops1  187
1    mops2  185
2    mops3   16
3    mops4  198
4    mops5   17
5    mops6   11

In [6]:
df.loc[3] # метка ряда получаем series

User ID                          4
UserName                     mops4
Age                            198
Joined Date    2111-08-08 00:00:00
Total Posts                  234.0
Reputation                      12
Name: 3, dtype: object

In [7]:
df.loc[2:3] # метка ряда получаем data_frame

   User ID UserName  Age Joined Date  Total Posts  Reputation
2        3    mops3   16  2013-07-06       2345.0         234
3        4    mops4  198  2111-08-08        234.0          12

In [13]:
df.loc[2:3, ['UserName', "Age",'Joined Date']]

  UserName  Age Joined Date
2    mops3   16  2013-07-06
3    mops4  198  2111-08-08

In [14]:
df.iloc[3]

User ID                          4
UserName                     mops4
Age                            198
Joined Date    2111-08-08 00:00:00
Total Posts                  234.0
Reputation                      12
Name: 3, dtype: object

In [15]:
df.iloc[2:4]

   User ID UserName  Age Joined Date  Total Posts  Reputation
2        3    mops3   16  2013-07-06       2345.0         234
3        4    mops4  198  2111-08-08        234.0          12

In [17]:
df.iloc[2:4, 1:4]

  UserName  Age Joined Date
2    mops3   16  2013-07-06
3    mops4  198  2111-08-08

In [18]:
df.iloc[:, 1:4]

  UserName  Age Joined Date
0    mops1  187  2032-01-01
1    mops2  185  2031-07-07
2    mops3   16  2013-07-06
3    mops4  198  2111-08-08
4    mops5   17  2001-09-09
5    mops6   11  2031-09-10